app/Http/Controllers/AuthController.php

    public function doRegister(RegisterRequest $request){
        $user = [
            'name' => $request->get('name'),
            'email' =>$request->get('email'),
            'password' => $request->get('password'),
            'createBy' => 'Registration',
        ];
        if(Email::checkEmail($user['email'])){
            return redirect()->back()->withInput()->with('emailErr', 'Email is already exist!');
        }
        $role_user = 2;
        $create = Sentinel::registerAndActivate($user);
        $roleUser = Sentinel::findRoleById($role_user);
        $roleUser->users()->attach($create);
---
insert into `role_users` (`created_at`, `role_id`, `updated_at`, `user_id`) values ('2022-12-27 10:45:49', 2, '2022-12-27 10:45:49', 105)