app/Http/Controllers/Email.php

    public static function checkEmail($email){
        $user = User::Select('id')->where('email', $email)->first();
---
select `id` from `users` where `email` = 'admin@admin.com' limit 1