app/Http/Controllers/UserController.php

    public function postCreate(RegisterRequest $request){
        $user = [
            'name' => $request->get('name'),
            'email' =>$request->get('email'),
            'password' => $request->get('password'),
        ];
        if(Email::checkEmail($user['email'])){
            return redirect()->back()->withInput()->with('emailErr', 'Email is already exist!');
        }
        $role_id = $request->get('role');
        $create = Sentinel::registerAndActivate($user);
        $roleUser = Sentinel::findRoleById($role_id);
        $roleUser->users()->attach($create);
---
insert into `role_users` (`created_at`, `role_id`, `updated_at`, `user_id`) values ('2022-12-27 01:54:08', 2, '2022-12-27 01:54:08', 113)

    public function update($id){
        $user = User::find($id);
        $role = Role::select(['roles.name as name'])->join('role_users', 'role_users.role_id', 'id')->where('user_id', $id)->first();
---
select * from `users` where `users`.`id` = '113' limit 1
select `roles`.`name` as `name` from `roles` inner join `role_users` on `role_users`.`role_id` = `id` where `user_id` = '113' limit 1

    public function postUpdate(RegisterRequest $request){
        $user = User::find($request->get('id'));
        if($user){
            $user->name = $request->get('name');
            $user->password = $request->get('password');
            $role = DB::table('role_users')
                ->where('user_id', $request->get('id'))
                ->update([
                'role_id' => $request->get('role'),
            ]);
---
select * from `users` where `id` in ('97')
update `role_users` set `role_id` = '1' where `user_id` = '110'

    public function destroy(Request $request){
        $id = $request->get('id');
        if($id){
            User::destroy($id);
---
delete from `users` where `id` = 97