app/Http/Controllers/Admin/AdminController.php

select `users`.`id`, `users`.`name`, `users`.`email`, `users`.`createBy`, `users`.`updateBy`, `users`.`last_login`, `users`.`created_at`, `users`.`updated_at`, `roles`.`name` as `role` from `users` inner join `role_users` as `ru` on `ru`.`user_id` = `users`.`id` inner join `roles` on `roles`.`id` = `ru`.`role_id` order by `id` desc limit 30 offset 0
---
    public function index(){
        $admin = Sentinel::getUser();
        $users = User::select([
            'users.id',
            'users.name',
            'users.email',
            'users.createBy',
            'users.updateBy',
            'users.last_login',
            'users.created_at',
            'users.updated_at',
            'roles.name AS role',
        ])
            ->join('role_users as ru', 'ru.user_id', 'users.id')
            ->join('roles', 'roles.id', 'ru.role_id')
            ->orderBy('id', 'desc')
            ->paginate(30);