app/Http/Controllers/Admin/AdminController.php

    public function index(){
        $users = User::select([
            'users.id',
            'users.name',
            'users.email',
            'users.password',
            'roles.name AS role',
        ])
            ->join('role_users as ru', 'ru.user_id', 'users.id')
            ->join('roles', 'roles.id', 'ru.role_id')
            ->orderBy('id', 'desc')
            ->paginate(30);
---
select `users`.`id`, `users`.`name`, `users`.`email`, `users`.`password`, `roles`.`name` as `role` from `users` inner join `role_users` as `ru` on `ru`.`user_id` = `users`.`id` inner join `roles` on `roles`.`id` = `ru`.`role_id` order by `id` desc limit 30 offset 90
select count(*) as aggregate from `users` inner join `role_users` as `ru` on `ru`.`user_id` = `users`.`id` inner join `roles` on `roles`.`id` = `ru`.`role_id`