app/Http/Controllers/Admin/UserController.php

    public function update($id){
        $user = Sentinel::findUserById($id);
        $role = Role::select(['roles.name as name'])->join('role_users', 'role_users.role_id', 'id')->where('user_id', $id)->first();
---
select `roles`.`name` as `name` from `roles` inner join `role_users` on `role_users`.`role_id` = `id` where `user_id` = '96' limit 1

    public function destroy(Request $request){
        $id = $request->get('id');
        if($id){
            User::destroy($id);
---
delete from `users` where `id` = 97